//=============================================================================
//
// FAILE NAME [BG.cpp]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: 背景を表示
//			
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include <d3d9.h>
#include <windows.h>
#include "../hedder/common.h"
#include "../hedder/Texture.h"
#include "../hedder/PrimitiveCreater.h"
#include "../hedder/BG.h"
#include "../hedder/Sound.h"
#include <dsound.h>

//=============================================================================
// グローバル変数
//=============================================================================
static BG g_BG;
static BOOL g_bBGTex = FALSE;

//=============================================================================
//
// 関数名	: BGInit関数
//
// 戻り値	: なし
//
// 引数		: なし
//
// 機能		: 背景の初期化
//
//=============================================================================
void BGInit( void )
{

		// 画像のロード
	TextureLoad( "photo/Stage.png" , BG_NUM );

	g_bBGTex = TRUE;
	
	// 背景座標X設定
	g_BG.fBgPosX = 0;

	// 背景座標Y設定
	g_BG.fBgPosY = 0;

	// 背景画像の座標X設定
	g_BG.fBgTexX1 = 0.f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY1 = 0.f;

	// 背景画像の座標X設定
	g_BG.fBgTexX2 = 1.f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY2 = 1.f;

}

//=============================================================================
//
// 関数名	: BGUpdate関数
//
// 戻り値	: なし
//
// 引数		: なし
//
// 機能		: 背景の更新
//
//=============================================================================
void BGLeftMove( void )
{
	// 背景画像の座標X設定
	g_BG.fBgTexX1 += 0.0025f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY1 = 0.f;

	// 背景画像の座標X設定
	g_BG.fBgTexX2 += 0.0025f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY2 = 1.f;

}

void BGRightMove( void )
{
	// 背景画像の座標X設定
	g_BG.fBgTexX1 += 0.0025f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY1 = 0.f;

	// 背景画像の座標X設定
	g_BG.fBgTexX2 += 0.0025f;

	// 背景画像の座標Y設定
	g_BG.fBgTexY2 = 1.f;
}


//=============================================================================
//
// 関数名	: BGDraw関数
//
// 戻り値	: なし
//
// 引数		: なし
//
// 機能		: 背景の描画
//
//=============================================================================
void BGDraw( void )
{
	PrimitiveCreate(	BGID			,		// どのプリミティブを作成するか
						2				,		// 頂点は回るか(1) 回らないか(2)
						BG_NUM			,		// テクスチャの番号
						0				,		// 角度※頂点が回らない場合０
						g_BG.fBgPosX	,		// X座標
						g_BG.fBgPosY	,		// Y座標
						BG_WIDTH		,		// 幅
						BG_HEIGHT		,		// 高さ
						g_BG.fBgTexX1	,		// テクスチャの頂点X座標
						g_BG.fBgTexY1	,		// テクスチャの頂点Y座標
						g_BG.fBgTexX2	,		// テクスチャの頂点X座標
						g_BG.fBgTexY2	);		// テクスチャの頂点X座標

}

//=============================================================================
//
// 関数名	: BGUninit関数
//
// 戻り値	: なし
//
// 引数		: なし
//
// 機能		: 背景の解放
//
//=============================================================================
void BGUninit( void )
{
	// テクスチャの解放
	TextureUninit( BG_NUM );
}