//=============================================================================
//
// FAILE NAME [math.cpp]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: いろいろな計算
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "../hedder/math.h "
#include <windows.h>
#include <d3dx9.h>

//=============================================================================
// グローバル変数
//=============================================================================
static float g_fWidthHalf	= 0;			// 幅の半分
static float g_fHeightHalf	= 0;			// 高さ半分


//=============================================================================
//
// 関数名	: AngleMath関数
//
// 戻り値	: 角度
//
// 引数		: 幅 , 高さ
//
// 機能		: 角度を求める
//
//=============================================================================
float AngleMath( float fWidth , float fHeight )
{
	// 幅の半分
	 g_fWidthHalf	=	fWidth	*	HALF;

	// 高さの半分
	 g_fHeightHalf	=	fHeight	*	HALF;

	// 角度
	float Angle = atan2f( g_fHeightHalf , g_fWidthHalf );


	// 角度を返す
	return Angle;
}

//=============================================================================
//
// 関数名	: RaidusMath関数
//
// 戻り値	: 半径
//
// 引数		: なし
//
// 機能		: 半径を求める
//
//=============================================================================
float RaidusMath( void )
{
	// 半径を求める
	float Raidus = sqrt( (g_fWidthHalf * g_fWidthHalf) + (g_fHeightHalf + g_fHeightHalf) );

	// 半径を返す
	return Raidus;
}