//=============================================================================
//
// FAILE NAME [.c]
//
// 名前		:
//
// クラス	: 
//
// 機能		:
//
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include <d3d9.h>
#include <windows.h>
#include "../hedder/WndProc.h"


//=============================================================================
// グローバル変数
//=============================================================================


//-----------------------------------------------------------------------------
//
// 変数名	: WndProc関数
//
// 戻り値	: LRESULT
//
// 引数		: HWND , UINT , WPARAM , LPARAM
//
// 機能		: わからない
//
//-----------------------------------------------------------------------------
LRESULT CALLBACK WndProc(HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam)
{
	switch(message)
	{	
	case WM_DESTROY:
		PostQuitMessage(0);
		break;

	case WM_KEYDOWN:
		switch(wParam)
		{
		case VK_ESCAPE :						// [ESC]キーが押された
			DestroyWindow( hWnd );				// ウィンドウを破棄するように指示
			break;
		}
	default:
		return DefWindowProc(hWnd , message , wParam , lParam);
		break;
	}

	return 0;
}



