/******************************************************************************
/ 敵-タイプB-処理 [enemyBeta.h]
/ 
/ 制作者 : 松尾 雄太
/
/ 制作日 : 2014年1月20日
/
/ 機能 : 回りながらプレイヤーに近づいてくる
******************************************************************************/

//============================================================================
// 2重インクルード
//============================================================================
#ifndef _ENEMYBETA_H_
#define _ENEMYBETA_H_

/*****************************************************************************
/ インクルード
*****************************************************************************/
#include "enemy.h"

/*****************************************************************************
/ クラス宣言
*****************************************************************************/
class CEnemyBeta : public CEnemy
{
public:
	CEnemyBeta(void);			// コンストラクタ
	void Init(void){}			// 初期化

	static CEnemyBeta *Create( VECTOR3D pos );		// 敵生成

	void Init( VECTOR3D pos );	// 初期化
	void UpDate(void);			// 更新
	void Draw(void);			// 描画

private:
	float m_fAngle;				// 回転角度
};

#endif //_ENEMYBETA_H_

// EOF
