/******************************************************************************
/ 敵-タイプA-処理 [enemyAlpha.h]
/ 
/ 制作者 : 松尾 雄太
/
/ 制作日 : 2014年1月
******************************************************************************/

//============================================================================
// 2重インクルード
//============================================================================
#ifndef _ENEMYDELTA_H_
#define _ENEMYDELTA_H_

/*****************************************************************************
/ インクルード
*****************************************************************************/
#include "enemy.h"

/*****************************************************************************
/ クラス宣言
*****************************************************************************/
class CEnemyDelta : public CEnemy
{
public:
	CEnemyDelta(void);			// コンストラクタ
	void Init(void){}			// 初期化

	static CEnemyDelta *Create( VECTOR3D pos, const char *tex);		// 敵生成

	void Init( VECTOR3D pos, const char *tex);		// 初期化
	void UpDate(void);			// 更新
	void Draw(void);			// 描画

private:
	float m_fAngle;				// 角度
	float m_fAngleMove;			// 角度変換量
	float m_fRadius;			// 半径
};

#endif //_ENEMYALPHA_H_

// EOF
