//=============================================================================
// デバッグコード出力処理[debugproc.h]
// 
// 製作者 : 松尾 雄太
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

//=============================================================================
// インクルード
//=============================================================================
#include <Windows.h>
#include <stdio.h>

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_STRING			(2048)				// 最大文字数

//=============================================================================
// プロトタイプ宣言
//=============================================================================
class CDebug
{
public: // 操作
	CDebug(void);								// デバッグインスタンス生成
	~CDebug(void);								// デバッグインスタンス破棄
	HRESULT Init(void);							// デバッグの初期化
	void Uninit(void);							// デバッグの破棄
	void Update(void);							// デバッグの更新
	void Draw(void);							// デバッグの描画
	void Print(char *pFmt , ...);				// デバッグの出力
	
	// プリミティブのライン種類取得
	D3DPRIMITIVETYPE	GetPolygonLine(void);	// プリミティブ
	bool				GetDebugMode(void);		// デバッグモード取得

private: // 要素
	LPD3DXFONT	m_pFont;						// フォントポインタ
	char		m_strDebug[MAX_STRING];			// 文字バッファ
	bool		m_bDebug;						// デバッグモード
	int			m_Polygon;						// ポリゴンの線の書き方
	char		*m_strLineType;					// プリミティブラインの種類名
};

#endif	// _DEBUGPROC_H_