//=============================================================================
// 入力処理	[input.h]
//
// 製作者	: 松尾 雄太
//=============================================================================

//=============================================================================
// 2重インクルードの防止マクロ
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//=============================================================================
// 入力デバイスを扱うためのマクロ
//=============================================================================
#ifndef DIRECTINPUT_VERSION
#define DIRECTINPUT_VERSION (0x0800)
#endif // DIRECTINPUT_VERSIPN

//=============================================================================
// インクルード
//=============================================================================
#include <dinput.h>

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_KEY	(256)	// キーボード最大数

//=============================================================================
// クラス定義
//=============================================================================
class CInput
{
public:		// 操作
	CInput(void);											// 入力インスタンス生成
	~CInput(void);											// 入力インスタンス破棄
	virtual HRESULT Init(HINSTANCE hInstance, HWND hWnd);	// 入力デバイス初期化
	virtual void Uninit(void);								// 入力デバイス破棄
	virtual HRESULT Update(void)=0;							// 入力デバイス更新

protected:	// 要素
	static LPDIRECTINPUT8 m_pDinput;						// 入力インターフェース
	LPDIRECTINPUTDEVICE8 m_pDinputDevice;					// 入力デバイス
};

#endif // _INPUT_H_