//=============================================================================
// 照明(ライト)処理	[light.h]
// 
// 製作者	: 松尾 雄太
//
// 機能		: ライト初期化
//			: 更新
//=============================================================================

//=============================================================================
// 2重インクルード防止
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// クラス定義
//=============================================================================
class CLight
{
public:
	CLight(void);						// ライトのインスタンス生成
	~CLight(void);						// ライトのインスタンス破棄
	HRESULT Init(void);					// ライトの初期化
	void Uninit(void);					// ライトの終了処理
	void Update(void);					// ライトの更新
private:
	enum
	{
		FIRST_LIGHT = 0,				// 1つ目のライト
		SECOND_LIGHT,					// 2つ目のライト
		THIRD_LIGHT,					// 3つ目のライト
		MAX_LIGHT						// ライト最大数
	};

	D3DLIGHT9 m_aLight[MAX_LIGHT];		// ライトの数
	D3DXVECTOR3 m_vecDir;				// ライトの向き
};

#endif //_LIGHT_H_

///// end of file /////