//=============================================================================
// ツール作成の前手順　　　　　　　　フィールド作成ツール用
//  
// 描画処理 [renderer.h]
//
// 機能 : レンダリング (DirectX)
//=============================================================================

//=============================================================================
// 2重インクルード防止
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//=============================================================================
// クラス宣言
//=============================================================================
class CRenderer
{
public:		// 操作
	CRenderer(void);							// インスタンス生成
	~CRenderer(void);							// インスタンス破棄
	HRESULT Init(HWND hWnd, BOOL bWidowMode);	// レンダラー初期化処理
	void	Uninit(void);						// レンダラー終了処理
	void	Update(void);						// レンダラー更新処理
	void	Draw(void);							// レンダラー描画処理

	LPDIRECT3DDEVICE9 GetDevice(void){return m_pDevice;}	// デバイス取得

private:	// 要素
	LPDIRECT3D9			m_pD3D;		// IDirect3D9インターフェース
	LPDIRECT3DDEVICE9	m_pDevice;	// IDirect3D9デバイスインターフェース
};	// end class

#endif	//_RENDERER_H_

// end of file //