//=============================================================================
// 影の処理 [shadow.cpp]
//
// 製作者	: 松尾 雄太
//
// 機能		: 影の作成 
//=============================================================================

//=============================================================================
// 2重インクルード防止
//=============================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

//=============================================================================
// インクルード
//=============================================================================
#include "scene3D.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// クラス宣言
//=============================================================================
class CShadow : public CScene3D
{
public:
	CShadow(int nPriority = 5, OBJTYPE objType = OBJTYPE_SHADOW);		// 影のインスタンス生成												// 影インスタンス生成
	~CShadow(void);														// 影インスタンス破棄
	static CShadow *Create(float fPosX, float fPosY, float fPosZ,
					float fWidth, float fHegiht, float fLenght,
					unsigned int nTexNum);								// 影の作成
	HRESULT Init(float fPosX, float fPosY, float fPosZ,	
					float fWidth, float fHeight, float fLenght,
					unsigned int nTexNum);								// 影の初期化処理
	void Uninit(void);													// 影の終了処理
	void Update(void);													// 影の更新処理
	void Draw(void);													// 影の描画処理
};

#endif // _SHADOW_H_

