//=============================================================================
// 木処理 [Tree.h]
//
// 製作者	: 松尾 雄太
//
// 機能		: 木作成
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _TREE_H_
#define _TREE_H_

//=============================================================================
// インクルード
//=============================================================================
#include "sceneBillboard.h"

//=============================================================================
// 構造体宣言
//=============================================================================

//=============================================================================
// クラス宣言
//=============================================================================
class CTree : public CBillboard 
{
public:		// 操作
	CTree(int nPriority = 5, OBJTYPE objType = OBJTYPE_TREE);			// 木インスタンス生成
	~CTree(void);														// 木インスタンス破棄
	static CTree *Create(float fWidth, float fHeight, 
							USHORT nTexNum);							// 木作成
	static CTree *CreateLoad(BILLBOARD dataTree);						// 木作成&読み込み
	
	HRESULT Init(void){return S_OK;}									// 木初期化
	HRESULT Init(float fWidth, float fHeight, 
					USHORT nTexNum);									// 木初期化
	void Uninit(void);													// 木終了
	void Update(void);													// 木更新
	void Draw(void);													// 木描画
};

#endif	// _TREE_H_