//=============================================================================
// 敵処理 [enemy.h]
//
// 製作者	: 松尾 雄太
//
// 機能		: 敵の作成
//=============================================================================

//=============================================================================
// 2重インクルード防止
//=============================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

//=============================================================================
// インクルード
//=============================================================================
#include "sceneX.h"

//=============================================================================
// マクロ定義
//=============================================================================
class CShadow;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
class CEnemy : public CSceneX
{
public:
	CEnemy(int nPriority = 3, OBJTYPE objType = OBJTYPE_ENEMY);		// 敵のインスタンス生成
	~CEnemy(void);													// 敵のインスタンス破棄
	static CEnemy *Create(float fPosX, float fPosY, float fPosZ,
				unsigned int nModelNum, unsigned int nTexNum);		// 敵の作成		
	HRESULT Init(float fPosX, float fPosY, float fPosZ,
				unsigned int nModelNum, unsigned int nTexNum);		// 敵の初期化
	void	Uninit(void);											// 敵破棄
	void	Update(void);											// 敵の更新
	void	Draw(void);												// 敵の描画
private:
	CShadow	*m_pShadow;
	bool	m_bDiscover;											// プレイヤー発見
};

#endif // _SCENEX_H_
