//=============================================================================
// ランキング処理 [ranking.h]
//
// 製作者	: 松尾 雄太
//
// 機能		: ランキング機能
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

//=============================================================================
// インクルード
//=============================================================================
#include "data.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_RANKING	( 5 )		// 順位数
class CScene2D;					// 2Dポリゴン
class CTimer;					// 番号クラス

//=============================================================================
// プロトタイプ宣言
//=============================================================================
class CRanking
{
public:	
	CRanking(void);													// ランキングインスタンス生成
	~CRanking(void);												// ランキングインスタンス破棄
	HRESULT Init(HWND hWnd);										// ランキング初期化処理
	void	Uninit(void);											// ランキング終了処理
	void	Update(void);											// ランキング更新処理
	void	Draw(void);												// ランキング描画
	static	CData		*GetData(void){return m_pData;}				// データ取得
	void	SetRankData(int nScore, int i){ m_nNumber[i] = nScore;}
private:
	void	Comparison(void);
	static CData		*m_pData;									// データポインター
	CScene2D			*m_pRankBack;								// ランキング背景
	CTimer				*m_pRanking[MAX_RANKING];					// ランキングの番号
	int					m_nNumber[MAX_RANKING];						
	bool				m_bFace;									// 次のモード移動フラグ
};

#endif	// _RANKING_H_
