//=============================================================================
// 結果処理 [result.h]
//
// 製作者	: 松尾 雄太
//
// 機能		: リザルト機能
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルード
//=============================================================================

//=============================================================================
// マクロ定義
//=============================================================================
class CScene2D;				// 2Dポリゴン
class CData;				// データ
class CTimer;				// タイマー

//=============================================================================
// プロトタイプ宣言
//=============================================================================
class CResult
{
public:	
	CResult(void);													// リザルトインスタンス生成
	~CResult(void);													// リザルトインスタンス破棄
	HRESULT Init(HWND hWnd);										// リザルト初期化処理
	void	Uninit(void);											// リザルト終了処理
	void	Update(void);											// リザルト更新処理
	void	Draw(void);												// リザルト描画
	static	CData		*GetData(void){return m_pData;}				// データ取得
	bool	GetFace(void){return m_bFace;}							// 次のモード移動
private:
	static CData		*m_pData;									// データポインター
	static CScene2D		*m_pTitleScene;								// リザルト画面
	CTimer				*m_pTimer;									// タイマー
	bool				m_bFace;									// 次のモード移動フラグ
};

#endif	// _RESULT_H_
