//=============================================================================
//
// clear処理 [clear.h] 松尾 雄太
//
//=============================================================================

//=============================================================================
// 2重インクルード
//=============================================================================
#ifndef _CLEAR_H_
#define _CLEAR_H_

//=============================================================================
// インクルード
//=============================================================================
#include "d3dx9.h"
#include "common.h"
#include "Font.h"
#include "InputKey.h"
#include "WinMain.h"

//=============================================================================
// マクロ定義
//=============================================================================
typedef struct
{
	float fPosX;									// 画像の設置位置
	float fPosY;									// 画像の設置位置
	float fWidth;									// 画像の幅
	float fHeight;									// 画像の高さ
	float fTexX0;									// 画像の座標X
	float fTexY0;									// 画像の座標Y
	float fTexX1;									// 画像の座標X
	float fTexY1;									// 画像の座標Y
	float fMoveX;									// モーションの速度
	float fMoveY;									// モーション速度
}Clear;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitClear(LPDIRECT3DDEVICE9 pDevice);		// 初期化
void UninitClear(void);								// 破棄
void UpdateClear(void);								// 更新
void DrawClear(LPDIRECT3DDEVICE9 pDevice);			// 描画

#endif // _CLEAR_H_