//=============================================================================
//
// フィールド処理 [EnemyLife.h]
//
// 名前	: 松尾 雄太
//
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _ENEMYLIFE_H_
#define _ENEMYLIFE_H_

//=============================================================================
// インクルード
//=============================================================================
#include <d3dx9.h>
#include "common.h"
#include "Camera.h"
#include "InputKey.h"
#include "meshwall.h"
#include "Bullet.h"
#include "Enemy.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT EnemyLifeInit(LPDIRECT3DDEVICE9 pD3DDevice);		// 敵の本元の初期化
void EnemyLifeUninit(void);									// 敵の本元破棄
void EnemyLifeUpdate(void);									// 敵の本元の更新
void EnemyLifeDraw(LPDIRECT3DDEVICE9 pD3DDevice);			// 敵の本元更新

#endif	// _ENEMYLIFE_H_
