//=============================================================================
//
// フィールド処理 [Field.h]
//
// 名前	: 松尾 雄太
//
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _FIELD_H_
#define _FIELD_H_

//=============================================================================
// インクルード
//=============================================================================
#include <d3dx9.h>
#include "common.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT FieldInit(LPDIRECT3DDEVICE9 pD3DDevice , float fPolygonWidth , float fPolygonHeight , int nFieldScl_X , int nFieldScl_Y);		// 地面の初期化
void FieldUninit(void);								// 地面破棄
void FieldUpdate(void);								// 地面の更新
void FieldDraw(LPDIRECT3DDEVICE9 pD3DDevice);		// 地面更新
D3DXVECTOR3 FieldPosGet(void);						// 地面位置表示

#endif	// _FIELD_H_
