//=============================================================================
//
// title処理 [title.h] 松尾 雄太
//
//=============================================================================

//=============================================================================
// 2重インクルード
//=============================================================================
#ifndef _OVER_H_
#define _OVER_H_

//=============================================================================
// インクルード
//=============================================================================
#include "d3dx9.h"
#include "common.h"
#include "Font.h"
#include "InputKey.h"
#include "WinMain.h"
#include "Sound.h"

//=============================================================================
// マクロ定義
//=============================================================================
typedef struct
{
	float fPosX;									// 画像の設置位置
	float fPosY;									// 画像の設置位置
	float fWidth;									// 画像の幅
	float fHeight;									// 画像の高さ
	float fTexX0;									// 画像の座標X
	float fTexY0;									// 画像の座標Y
	float fTexX1;									// 画像の座標X
	float fTexY1;									// 画像の座標Y
	float fMoveX;									// モーションの速度
	float fMoveY;									// モーション速度
}Over;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitOver(LPDIRECT3DDEVICE9 pDevice);		// 初期化
void UninitOver(void);								// 破棄
void UpdateOver(void);								// 更新
void DrawOver(LPDIRECT3DDEVICE9 pDevice);			// 描画

#endif // _OVER_H_