//=============================================================================
//
// ライト処理 [Light.cpp]
//
// 名前	: 松尾 雄太
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "../hedder/Light.h"

//=============================================================================
// グローバル変数
//=============================================================================
static D3DLIGHT9 g_aLight[3];		// ライト変数

//=============================================================================
//
//	関数名	: LightInit
//	
//	戻り値	: なし
//
//	引数	: デバイス
//
//	機能	: ライト初期化
//
//=============================================================================
void LightInit( LPDIRECT3DDEVICE9 pD3DDevice )
{
	//---------------------------------
	// 変数宣言
	D3DXVECTOR3 vecDir;		// 方向ベクトル変数

	//-------------------------------------------------------------------------
	// 1つ目のライト初期化
	ZeroMemory( &g_aLight[0] , sizeof( D3DLIGHT9 ) );	// メモリ全初期化
	g_aLight[0].Type = D3DLIGHT_DIRECTIONAL;			// ライトの種類
	g_aLight[0].Diffuse = D3DXCOLOR( 1.0f , 1.0f , 1.0f , 1.0f );	// 拡散色設定( R,G,B,A ) 

	//*********************************
	// ライトの方向
	vecDir = D3DXVECTOR3( -1.0f, -1.0f , 0.0f );			// ライトの方向
	D3DXVec3Normalize( ( D3DXVECTOR3 * )&g_aLight[0].Direction , &vecDir );	// ライトの方向修正

	//*********************************
	// ライトのセッティング
	pD3DDevice->SetLight( 0 , &g_aLight[0] );
	pD3DDevice->LightEnable( 0 , TRUE );			// ライトを有効にする

	//-------------------------------------------------------------------------
	// 2つ目のライト初期化
	ZeroMemory( &g_aLight[1] , sizeof( D3DLIGHT9 ) );	// メモリ全初期化
	g_aLight[1].Type = D3DLIGHT_DIRECTIONAL;			// ライトの種類
	g_aLight[1].Diffuse = D3DXCOLOR( 0.5f , 0.5f , 0.5f , 0.5f );	// 拡散色設定

	//*********************************
	// ライトの方向
	vecDir = D3DXVECTOR3( 0.4f , 0.5f , -1.0f );			// ライトの方向
	D3DXVec3Normalize( ( D3DXVECTOR3 * )&g_aLight[1].Direction , &vecDir );	// ライトの方向修正
	
	//**********************************
	// ライトのセッティング
	pD3DDevice->SetLight( 1 , &g_aLight[1] );
	pD3DDevice->LightEnable( 1 , TRUE );			// ライトを有効にする

	//-------------------------------------------------------------------------
	// 3つ目のライト初期化
	ZeroMemory( &g_aLight[2] , sizeof( D3DLIGHT9 ) );	// メモリ全初期化
	g_aLight[2].Type = D3DLIGHT_DIRECTIONAL;			// ライトの種類
	g_aLight[2].Diffuse = D3DXCOLOR( 0.2f , 0.2f , 0.2f , 0.2f );	// 拡散色設定

	//*********************************
	// ライトの方向
	vecDir = D3DXVECTOR3( -0.4f , 0.3f , 1.0f );			// ライトの方向
	D3DXVec3Normalize( ( D3DXVECTOR3 * )&g_aLight[2].Direction , &vecDir );	// ライトの方向修正

	//*********************************
	// ライトのセッティング
	pD3DDevice->SetLight( 2 , &g_aLight[2] );
	pD3DDevice->LightEnable( 2 , TRUE );			// ライトを有効にする

	//-------------------------------------------------------------------------
	// レンダーステート設定
	pD3DDevice->SetRenderState( D3DRS_LIGHTING , TRUE );
}
