/******************************************************************************
/ 敵処理 [ enemy.cpp ]
/
/ 制作者 : 松尾 雄太
/
/ 制作日 : 2014/01/20
/
/ 機能 : 左右に揺れながら近づいてくる
******************************************************************************/

/*****************************************************************************
/ インクルード
*****************************************************************************/
#include "enemyAlpha.h"
#include "score.h"

/*****************************************************************************
/ マクロ定義
*****************************************************************************/
#define ALPHA_HP		( 3 )		// 体力量
#define ALPHA_ATTACK	( 1 )		// 攻撃量

/*****************************************************************************
/ 関数名	: CEnemyAlpha
/ 
/ 戻り値	: なし
/ 引数		: なし
/ 機能		: 敵インスタンス生成
*****************************************************************************/
CEnemyAlpha::CEnemyAlpha(void)
{
	m_pos = VECTOR3D( 0, 0, 0 );			// 位置
	m_move = VECTOR3D( 0, 0, 0 );			// 移動
	m_nHP = 1;								// 体力
	m_nAttack = 0;							// 攻撃
	m_nStopTime = 0;						// 移動停止時間
}

/*****************************************************************************
/ 関数名	: Create
/ 
/ 戻り値	: Enemyポインタ
/ 引数		: モデルパス,　位置
/ 機能		: 敵生成
*****************************************************************************/
CEnemyAlpha *CEnemyAlpha::Create( VECTOR3D pos  )
{
	CEnemyAlpha *pEnemy;

	pEnemy = new CEnemyAlpha;
	pEnemy->Init( pos );
	return pEnemy;
}

/*****************************************************************************
/ 関数名	: Init
/ 
/ 戻り値	: なし
/ 引数		: モデルテキスト,　位置
/ 機能		: 初期化
*****************************************************************************/
void CEnemyAlpha::Init( VECTOR3D pos )
{
	CSceneModelGL::Init( pos, "./data/model/teki1.obj" );
	m_move.x = 0.2f;
	m_move.z = 0.05f;
	m_nHP = ALPHA_HP;
	m_nAttack = ALPHA_ATTACK;

	// 衝突設定
	m_pCollision = CCollision::SetCollision( this,
										&m_pos,
										&m_move,
										CCollision::COL_SHAPE_SPHERE,
										COL_TYPE_PLAYER|
										COL_TYPE_PLBULLET,
										VECTOR3D( 1.0f, 1.0f, 1.0f ) );
										

	// 自身の種類
	m_colStatus.colType = COL_TYPE_ENEMY;
}


/*****************************************************************************
/ 関数名	: Update
/ 
/ 戻り値	: なし
/ 引数		: なし
/ 機能		: 更新
*****************************************************************************/
void CEnemyAlpha::UpDate(void)
{	

}

/*****************************************************************************
/ 関数名	: Draw
/ 
/ 戻り値	: なし
/ 引数		: なし
/ 機能		: 描画
*****************************************************************************/
void CEnemyAlpha::Draw(void)
{
	CSceneModelGL::Draw();
}





