//=============================================================================
//
// FAILE NAME [BG.h]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: 背景のマクロ, 配列, 列挙型
//			
//=============================================================================
#ifndef _BG_H_
#define _BG_H_

//=============================================================================
// マクロ定義
//=============================================================================
#define BG_NUM			( 1 )
#define BG_WIDTH		( 640 )			// 背景の最大幅
#define BG_HEIGHT		( 480 )			// 背景の最大高さ

//=============================================================================
// 配列宣言
//=============================================================================
typedef struct
{
	float fBgPosX	;					// 背景の座標X
	float fBgPosY	;					// 背景の座標Y
	float fBgTexX1	;					// 背景画像の座標X
	float fBgTexY1	;					// 背景画像の座標Y
	float fBgTexX2	;					// 背景画像の座標X
	float fBgTexY2	;					// 背景画像の座標Y
}BG;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void BGInit( void )		;				// 背景の初期化
void BGLeftMove( void );				// 背景を左に移動
void BGRightMove( void );				// 背景を右に移動
void BGDraw( void )		;				// 背景の描画
void BGUninit( void )	;				// 背景の解放

#endif //_BG_H_