//=============================================================================
//
// FAILE NAME	[Clear.h]
//
// 名前		:	松尾 雄太
//
// クラス	:	AT12C283
//
// 機能		:	ゲームクリア用マクロ
//				構造体
//
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _CLEAR_H_
#define _CLEAR_H_

//=============================================================================
// マクロ定義
//=============================================================================
#define CLEARNUM		( 11 )					// テクスチャ番号
#define CLEARSOUND		( 6 )					// サウンド番号
#define CLEARTEXX0		( 0.f )					// テクスチャ座標X( 初めの座標 ) 
#define CLEARTEXX1		( 1.f )					// テクスチャ座標X( 終わりの座標 )
#define CLEARTEXY0		( 0.f )					// テクスチャ座標Y( 初めの座標 )
#define CLEARTEXY1		( 1.f )					// テクスチャ座標Y( 終わりの座標 )
#define CLEARTEXXMAX	( 1.f )					// テクスチャ座標Xの最大値
#define CLEARTEXYMAX	( 1.f )					// テクスチャ座標Yの最大値

//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	float fClearPosX;
	float fClearPosY;
	float fClearWidth;
	float fClearHeight;
	float fClearCLEARTEXX0;
	float fClearCLEARTEXY0;
	float fClearCLEARTEXX1;
	float fClearCLEARTEXY1;
}DRAWCLEAR;

//=============================================================================
// プロトタイプ宣言
//=============================================================================

void ClearInit( void );
void ClearUpdate( void );
void ClearDraw( void );
void ClearUninit( void );

#endif	// _ClearE_H_
