//=============================================================================
//
// フォント表示 [font.cpp]
//
// 学籍 10304 　氏名 松尾 雄太
//
//=============================================================================

//=============================================================================
// 二重インクルード防止
//=============================================================================
#ifndef _FONT_H_
#define _FONT_H_

//=============================================================================
// インクルード
//=============================================================================
#include <d3dx9.h>

typedef struct
{
	char nPlayerHP[4];
	char nEnemyHP[4];
	char nGameTimer[4];
}DRAWFONT;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void FontInit( INT		Height		,		// フォントの高さ
			   UINT		Width		,		// フォントの幅
			   UINT		Weight		,		// フォントの太さ
			   LPCSTR	str		);			// 表示したい文字	

void FontDraw(	LONG fLeft,					// 左
				LONG fTop,					// 上
				LONG fRight,				// 右
				LONG fBottom,				// 下
				//INT	 A		,				// 透明度( 255は不透明 0は透明 )
				//INT	 R		,				// 赤色の度合い
				//INT	 G		,				// 緑色の度合い
				//INT	 B		,				// 青色の度合い
				CHAR *str );				// フォントの表示

void FontUninit( void );					// フォントの破棄

#endif // _FONT_H_
