//=============================================================================
//
// FAILE NAME [InputKey.h]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: マクロ定義
//			　プロトタイプ宣言
//
//
//=============================================================================
#ifndef DIRECTINPUT_VERSION
#define DIRECTINPUT_VERSION (0x0800)
#endif  // DIRECTINPUT_VERSION

//=============================================================================
// 二重インクルード防止
//=============================================================================
#ifndef _INPUTKEY_H_
#define _INPUTKEY_H_

//=============================================================================
// インクルード
//=============================================================================
#include <dinput.h>

//=============================================================================
// マクロ定義
//=============================================================================
#define KYKBOARD_MAX	(256)							// キーボードのボタン数

//=============================================================================
// プロトタイプ宣言
//=============================================================================
BOOL InitInput( HINSTANCE hInstance , HWND hWnd );		// 入力キー初期化

void UninitInput(void);									// 入力キーを解放

void UpdateInput(void);									// 入力キーを更新

BOOL KeyState(int i);									// キーを押しっぱなし

BOOL KeyRelease(int i);									// キーを離した時

BOOL KeyPush(int i);									// キーを押した瞬間

#endif // _INPUTKEY_H_
