//=============================================================================
//
// FAILE NAME [Judgment.h]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: 判定マクロ定義 , 配列 , プロトタイプ宣言
//			
//=============================================================================
#ifndef _JUDGMENT_H_
#define _JUDGMENT_H_


//=============================================================================
// インクルード
//=============================================================================
#include <d3d9.h>
#include <windows.h>

//=============================================================================
// マクロ定義
//=============================================================================
#define ALIVE_TIMEWATE		( 200 )
#define TURN_TIMEWATE		( 120 )

//=============================================================================
// 列挙型宣言
//=============================================================================
enum
{
	NO_OUT	= 0	,		// 画面外に出ていない
	LEFT_OUT	,		// 左画面外
	RIGHT_OUT	,		// 右画面外
	UP_OUT		,		// 上画面外
	DOWN_OUT	,		// 下画面外
};

//=============================================================================
// プロトタイプ宣言
//=============================================================================

// 当たり判定
BOOL HitJudg(	float fax , float fay , float faw , float fah ,
				float fbx , float fby , float fbw , float fbh );

// 操縦判定
void PlayerControlJudg( void );

// 復活判定
void RebornJudg( void );

// 攻撃復活判定
void TurnJudg( void );

// 画面外判定
int ScreenOutJudg( float fX , float fY , float fWidth , float  fHeight);

#endif // JUDGMENT_H_