//=============================================================================
//
// FAILE NAME	[Over.h]
//
// 名前		:	松尾 雄太
//
// クラス	:	AT12C283
//
// 機能		:	タイトル用マクロ
//				構造体
//
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _OVER_H_
#define _OVER_H_

//=============================================================================
// マクロ定義
//=============================================================================
#define OVERNUM		( 12 )					// テクスチャ番号
#define OVERSOUND	( 7 )					// サウンド番号
#define OVERTEXX0	( 0.f )					// テクスチャ座標X( 初めの座標 ) 
#define OVERTEXX1	( 1.f )					// テクスチャ座標X( 終わりの座標 )
#define OVERTEXY0	( 0.f )					// テクスチャ座標Y( 初めの座標 )
#define OVERTEXY1	( 1.f )					// テクスチャ座標Y( 終わりの座標 )
#define OVERWATE	( 60 )					// タイトルモーション待ち時間

//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	float fOverPosX;
	float fOverPosY;
	float fOverWidth;
	float fOverHeight;
	float fOverTexX0;
	float fOverTexY0;
	float fOverTexX1;
	float fOverTexY1;
}DRAWOVER;

//=============================================================================
// プロトタイプ宣言
//=============================================================================

void OverInit( void );
void OverUpdate( void );
void OverDraw( void );
void OverUninit( void );

#endif	// OVER_H_
