//=============================================================================
//
// FAILE NAME [Texture.h]
//
// 名前		: 松尾 雄太
//
// クラス	: AT12C283
//
// 機能		: テクスチャに関するマクロ定義
//			　プロトタイプ宣言
//
//
//=============================================================================

//============================================================================
//　2重インクルード防止
//============================================================================
#ifndef _TEXTLOAD_H_
#define _TEXTLOAD_H_

//============================================================================
// インクルード
//============================================================================
#include <d3dx9.h>
#include <windows.h>

//============================================================================
//　マクロ定義
//============================================================================
#define TEXTUREMAX	(40)									// テキスチャの最大枚数

#define FVF_VERTEX_2D_TEX	(D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1)
							//↑				↑　		↑
							//X軸、Y軸、z軸 | 色の定義 | 	テクスチャ


//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	D3DVECTOR	vtx		;									// 頂点座標(x,y,z)
	float		rhw		;									// reciprocal homogeneous w(同次座標のw要素の逆数)
	D3DCOLOR	diffuse	;									// 色の情報

}VERTEX_2D_TEX;												// 構造体名



//============================================================================
//　プロトタイプ宣言
//============================================================================
HRESULT				TextureLoad( char *str, int Numof )	;	// テキスチャー読み込み
				
void				TextureUninit( int Numof )			;	// テキスチャーの破棄

LPDIRECT3DTEXTURE9*	GetD3DTexture( int Num )			;	// テキスチャー渡し

#endif	// _TEXTLOAD_H_