//=============================================================================
//
// FAILE NAME	[Title.h]
//
// 名前		:	松尾 雄太
//
// クラス	:	AT12C283
//
// 機能		:	タイトル用マクロ
//				構造体
//
//=============================================================================

//=============================================================================
// 2重インクルードの防止
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//=============================================================================
// マクロ定義
//=============================================================================
#define TITLENUM	( 0 )					// テクスチャ番号
#define TITLESOUND	( 0 )					// サウンド番号
#define TEXX0		( 0.f )					// テクスチャ座標X( 初めの座標 ) 
#define TEXX1		( 1.f * 0.5f )			// テクスチャ座標X( 終わりの座標 )
#define TEXY0		( 0.f )					// テクスチャ座標Y( 初めの座標 )
#define TEXY1		( 1.f * 0.5f )			// テクスチャ座標Y( 終わりの座標 )
#define TEXXMAX		( 1.f )					// テクスチャ座標Xの最大値
#define TEXYMAX		( 1.f )					// テクスチャ座標Yの最大値
#define TITLEWATE	( 60 )					// タイトルモーション待ち時間

//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	float fTitlePosX;
	float fTitlePosY;
	float fTitleWidth;
	float fTitleHeight;
	float fTitleTexX0;
	float fTitleTexY0;
	float fTitleTexX1;
	float fTitleTexY1;
}DRAWTITLE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================

void TitleInit( void );
void TitleUpdate( void );
void TitleDraw( void );
void TitleUninit( void );

#endif	// _TITLE_H_
